mtosi_1.1/IIS/xml/notifications/eventLossCleared.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns="tmf854.v1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="tmf854.v1 ../../xsd/common/header.xsd tmf854.v1 ../../xsd/interfaces/InventoryRetrieval.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <header tmf854Version="1.0">
      <activityName>notify</activityName>
      <msgName>notify</msgName>
      <msgType>NOTIFICATION</msgType>
      <senderURI>/MTOSI/EMS01</senderURI>
      <destinationURI>/MTOSI/InventoryOS</destinationURI>
      <communicationPattern>Notification</communicationPattern>
      <communicationStyle>MSG</communicationStyle>
      <timestamp>20051004140305</timestamp>
    </header>
  </soap:Header>
  <soap:Body>
    <notify tmf854Version="1.0">
      <topic>Inventory</topic>
      <message>
        <EventLossCleared>
          <notificationId>0001245</notificationId>
          <objectType>OT_OS</objectType>
          <objectName>
            <osNm>OsName</osNm>
          </objectName>
          <endTime>20041106210627.3</endTime>
          <vendorExtensions/>
        </EventLossCleared>
      </message>
    </notify>
  </soap:Body>
</soap:Envelope>
